app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2016-02-07 22:39:04.957665"], ["updated_at", "2016-02-07 22:39:04.957665"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2016-02-07 22:39:04.964280"], ["updated_at", "2016-02-07 22:39:04.964280"]]
---
  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      Song.create(Song_Clean: song[0], ARTIST_Clean: song[1], Release_Year: song[2], COMBINED: song[3], First?: song[4], Year?: song[5], Play_Count: song[6], F*G: song[7])